In [1]:
import pandas as pd
import numpy as np

## Вводная часть

Немного пояснений по Pandas
(и математике (это знать нужно, а не забывать!)).

МЕДИАНА, она же, видимо, и .median():
* Если *нечетное* количество чисел: элемент посередине есть медиана;
* Если *четное*: медиана есть среднее арифметическое двух чисел посередине.

СРЕДНЕЕ, оно же .mean():
* Просто среднее арифметическое всех чисел, изи-бризи.

In [2]:
# Чтение данных из файла
# data - объект DataFrame
data = pd.read_csv('data/beauty.csv', sep=';')

In [3]:
# Первые 5 записей
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [4]:
# Количество объектов и признаков
data.shape

(1260, 10)

In [5]:
# Краткая статистика набора данных
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [6]:
# Краткая статистика по числовым признакам
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [8]:
# Проиндексированный список с меткой: Series
data['exper'][:5]

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

# loc и iloc

In [9]:
# Индексация по названию: loc
data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [10]:
# Индексация по номеру: iloc
data.iloc[:13:4]  # с 0 по 13 строку с шагом 4

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,0,1,1,1,14,4
4,11.42,27,0,1,0,0,1,0,16,3
8,5.00,5,0,1,0,1,0,0,16,3
12,5.14,19,0,1,0,0,1,1,17,2

## Выборка

In [11]:
# Выборка женщин с доходом 
data[data['female'] == 1]['wage'][:5]

0    5.73
1    4.28
2    7.96
5    3.91
8    5.00
Name: wage, dtype: float64

In [12]:
# Средний доход женщин
data[data['female'] == 1]['wage'].mean()

4.299357798165137

In [13]:
# Средний доход женщин и мужчин
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] == 0]['wage'].mean()

(4.299357798165137, 7.3688228155339806)

In [14]:
# Медианный доход женатых мужчин
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median()

6.710000000000001

## Далее

In [15]:
# Создается объект
data.groupby('looks')

In [16]:
# Перейдем к циклу
for i in data.groupby('looks'):
    print(type(i))
# Получим тип i - 'tuple'

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [23]:
# Дополним предыдущее
for look, sub_df in data.groupby('looks'):
    print(look)                     # Получим 5 циферок всего
    print(sub_df['wage'].median())  # Медианный доход для каждого look
    print(sub_df['female'].mean())  # Доля женщин
    #print(sub_df.head())           # Получим 5 датафреймов; look [1:5]

1
3.46
0.38461538461538464
2
4.595000000000001
0.38028169014084506
3
5.635
0.32271468144044324
4
5.24
0.37362637362637363
5
4.81
0.42105263157894735

In [24]:
# Заметка: looks - категориальный признак.

In [25]:
# Добавим еще признак для группировки
for look, sub_df in data.groupby(['looks', 'female']):
    print(look)  # Декартово произведение циферок

(1, 0)
(1, 1)
(2, 0)
(2, 1)
(3, 0)
(3, 1)
(4, 0)
(4, 1)
(5, 0)
(5, 1)

In [26]:
# Среднее для признаков доход и опыт работы
data.groupby('looks')[['wage', 'exper']].agg(np.median)
#data.groupby('looks')['wage', 'exper'].agg(np.median) # it's the same

        wage  exper
looks
1      3.460   32.0
2      4.595   18.0
3      5.635   18.0
4      5.240   12.5
5      4.810    8.0

In [27]:
# Как связаны; таблицы сопряженности
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [28]:
pd.crosstab(data['female'], data['looks'])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

In [29]:
# Добавить столбец (бедные/богатые - 75%)

data['wage'].describe()  # Как будем определять этот критерий
data['is_rich'] = data['wage'] > data['wage'].quantile(.75)  # Условие
data['is_rich'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')  # Делаем циферками

# Теперь появился новый признак!

In [30]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [31]:
# !ALERT! Покутим: Найдем сумму дохода и опыта работы... Это можно и в столбец преобразовать!
data['nonsense'] = .56 * data['wage'] + 0.32 * data['exper']  # ЭТО ЕРУНДА (c)

In [32]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich,nonsense
0,5.73,30,0,1,0,1,1,1,14,4,0,12.8088
1,4.28,28,0,1,0,1,1,0,12,3,0,11.3568
2,7.96,35,0,1,0,1,0,0,10,4,1,15.6576
3,11.57,38,0,1,0,0,1,1,16,3,1,18.6392
4,11.42,27,0,1,0,0,1,0,16,3,1,15.0352

In [33]:
# Применение функции к каждому столбцу
data.apply(np.mean)
# Чисто функциональное программирование))

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
is_rich      0.250000
nonsense     9.357778
dtype: float64

In [38]:
# Пример с лямбда-функцией: построение нового признака
data['female'].apply(lambda female: 'female' if female else 'male').head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object

In [39]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich,nonsense
0,5.73,30,0,1,0,1,1,1,14,4,0,12.8088
1,4.28,28,0,1,0,1,1,0,12,3,0,11.3568
2,7.96,35,0,1,0,1,0,0,10,4,1,15.6576
3,11.57,38,0,1,0,0,1,1,16,3,1,18.6392
4,11.42,27,0,1,0,0,1,0,16,3,1,15.0352

In [41]:
# Построить признак на основе словаря
d = {1: 'union', 0: 'non-union'}
data['union'].map(d).head(9)

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
5    non-union
6    non-union
7        union
8    non-union
Name: union, dtype: object

In [42]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich,nonsense
0,5.73,30,0,1,0,1,1,1,14,4,0,12.8088
1,4.28,28,0,1,0,1,1,0,12,3,0,11.3568
2,7.96,35,0,1,0,1,0,0,10,4,1,15.6576
3,11.57,38,0,1,0,0,1,1,16,3,1,18.6392
4,11.42,27,0,1,0,0,1,0,16,3,1,15.0352